Repository: lcsouzamenezes/libextractor
Catalog: po/*.po
Languages: ro

source: Usage: %s %s
ro: Folosire: %s %s

source: Arguments mandatory for long options are also mandatory for short options.
ro: Argumentele obligatorii pentru opþiunile lungi sunt obligatorii ºi pentru opþiunile scurte.

source: do not remove any duplicates
ro: nu îndepãrta nici un duplicat

source: print output in bibtex format
ro: afiºeazã ieºirea în format bibtex

source: use the generic plaintext extractor for the language with the 2-letter language code LANG
ro: foloseºte extractorul text-simplu generic pentru limba cu codul de limbã din 2 litere LANG

source: remove duplicates only if types match
ro: îndepãrteazã duplicatele numai dacã tipul este acelaºi

source: use the filename as a keyword (loads filename-extractor plugin)
ro: foloseºte numele de fiºier ca ºi cuvânt cheie (încarcã plugin nume_fiºier-extractor)

source: print this help
ro: afiºeazã acest mesaj de ajutor

source: compute hash using the given ALGORITHM (currently sha1 or md5)
ro: calculeazã tabela de dispersie (hash) folosind ALGORITM-ul dat (curent sha1 sau md5)

source: load an extractor plugin named LIBRARY
ro: încarcã un plugin extractor numit LIBRÃRIE

source: list all keyword types
ro: listeazã toate tipurile de cuvinte cheie

source: do not use the default set of extractor plugins
ro: nu folosi setul implicit de plugin-uri extractor

source: print only keywords of the given TYPE (use -L to get a list)
ro: afiºeazã numai cuvintele cheie pentru TIP-ul dat (foloseºte -L pentru a obþine o listã

source: remove duplicates even if keyword types do not match
ro: îndepãrteazã duplicatele chiar dacã tipurile cuvintelor cheie nu sunt aceleaºi

source: use keyword splitting (loads split-extractor plugin)
ro: foloseºte spargere dupã cuvinte cheie (încarcã plugin-ul split-extractor)

source: print the version number
ro: afiºeazã numãrul versiunii

source: be verbose
ro: fi vorbãreþ

source: do not print keywords of the given TYPE
ro: nu afiºa cuvinte cheie de TIP-ul dat

source: extract [OPTIONS] [FILENAME]*
ro: extract [OPÞIUNI] [NUME_FIªIER]*

source: Extract metadata from files.
ro: Extrage metadata din fiºiere.

source: %s - (binary)
ro: %s - (binar)

source: INVALID TYPE - %s
ro: TIP INVALID - %s

source: title
ro: titlu

source: filename
ro: nume_fiºier

source: author
ro: autor

source: description
ro: descriere

source: keywords
ro: cuvinte cheie

source: comment
ro: comentariu

source: date
ro: data

source: creation date
ro: data creãrii

source: publisher
ro: publicist

source: organization
ro: organizaþie

source: subject
ro: subiect

source: page count
ro: numãr de pagini

source: You must specify an argument for the '%s' option (option ignored).
ro: Trebuie sã specificaþi un argument pentru opþiunea '%s' (opþiune ignoratã).

source: Use --help to get a list of options.
ro: Folosiþi --help pentru a obþine o listã de opþiuni.

source: Keywords for file %s:
ro: Cuvinte cheie pentru fiºier %s:

source: unknown
ro: necunoscut

source: language
ro: limbã

source: genre
ro: gen

source: location
ro: locaþie

source: version
ro: versiune

source: contributor
ro: contribuitor

source: resource-type
ro: tip-resursã

source: resource-identifier
ro: identificator-resursã

source: source
ro: sursã

source: relation
ro: relaþie

source: coverage
ro: acoperire

source: disclaimer
ro: repudiere

source: warning
ro: avertisment

source: translated
ro: tradus

source: modification date
ro: data modificãrii

source: producer
ro: producãtor

source: page orientation
ro: orientare paginã

source: paper size
ro: dimensiune pagina

source: used fonts
ro: fonturi folosite

source: page order
ro: ordine pagini

source: created for
ro: creat pentru

source: magnification
ro: mãrire

source: group
ro: grup

source: size
ro: mãrime

source: summary
ro: cuprins

source: packager
ro: împachetator

source: vendor
ro: vânzãtor

source: license
ro: licenþã

source: distribution
ro: distribuþie

source: build-host
ro: gazdã-contruit

source: os
ro: sistem operare

source: dependency
ro: dependinþe

source: resolution
ro: rezoluþie

source: category
ro: categorie

source: book title
ro: titlu de carte

source: priority
ro: prioritate

source: conflicts
ro: conflicte

source: replaces
ro: înlocuieºte

source: provides
ro: furnizeazã

source: conductor
ro: conducãtor

source: interpreter
ro: interpret(ã)

source: owner
ro: proprietar

source: lyrics
ro: versuri

source: media type
ro: tipul media

source: binary thumbnail data
ro: data thumbnail binar

source: Initialization of plugin mechanism failed: %s!
ro: iniþializare mecanismului de plugin a eºuat: %s!

source: Resolving symbol '%s' in library '%s' failed, so I tried '%s', but that failed also. Errors are: '%s' and '%s'.
ro: Rezolvarea simbolului '%s' în biblioteca '%s' a eºuat, aºa cã am încercat '%s', dar ºi acesta a eºuat. Erorile sunt: '%s' ºi '%s'.

source: Loading '%s' plugin failed: %s
ro: Încãrcarea plugin-ului '%s' a eºuat: %s

source: Unloading plugin '%s' failed!
ro: Descãrcarea plugin-ului '%s' a eºuat!

source: %s: option `%s' is ambiguous
ro: %s: opþiunea `%s' este ambiguã

source: %s: option `--%s' doesn't allow an argument
ro: %s: opþiunea `--%s' nu permite un argument

source: %s: option `%c%s' doesn't allow an argument
ro: %s: opþiunea `%c%s' nu permite un argument

source: %s: option `%s' requires an argument
ro: %s: opþiunea `%s' necesitã un argument

source: %s: unrecognized option `--%s'
ro: %s: opþiune nerecunoscutã `--%s'

source: %s: unrecognized option `%c%s'
ro: %s: opþiune nerecunoscutã `%c%s'

source: %s: illegal option -- %c
ro: %s: opþiune ilegalã -- %c

source: %s: invalid option -- %c
ro: %s: opþiune ilegalã -- %c

source: %s: option requires an argument -- %c
ro: %s: opþiunea necesitã un argument -- %c

source: %s: option `-W %s' is ambiguous
ro: %s: opþiunea `-W %s' este ambiguã

source: %s: option `-W %s' doesn't allow an argument
ro: %s: opþiunea `-W %s' nu permite un argument

source: No error
ro: Ni o eroare

source: Unknown host
ro: Gazdã necunoscutã

source: Host name lookup failure
ro: Cãutarea (lookup) numelui gazdei a eºuat

source: Unknown server error
ro: Eroare server necunoscutã

source: No address associated with name
ro: Nici o adresã asociatã cu numele

source: Internal resolver error
ro: Eroare resolver intern

source: Unknown resolver error
ro: Eroare resolver necunoscutã

source: Cannot determine root directory (%s)
ro: Nu pot determina directorul root (%s)

source: Cannot determine home directory (%s)
ro: Nu pot determina directorul acasã (%s)

source: Not super-user
ro: Nu sunteþi super-utilizator

source: No such file or directory
ro: Nici un asemenea fiºier sau director

source: No such process
ro: Nici un asemenea proces

source: Interrupted system call
ro: Apel sistem întrerupt

source: I/O error
ro: Eroare I/O

source: No such device or address
ro: Nici un asemenea dispozitiv sau adresã

source: Arg list too long
ro: Listã de argumente prea lungã

source: Exec format error
ro: Eroare format exec

source: Bad file number
ro: Numãr de fiºier incorect

source: No children
ro: Nici un copil

source: Resource unavailable or operation would block, try again
ro: Resursã indisponibilã sau operaþia s-ar bloca, încercaþi din nou

source: Not enough memory
ro: Memorie insuficientã

source: Permission denied
ro: Permisiune refuzatã

source: Bad address
ro: Adresa incorectã

source: Block device required
ro: Dispozitiv bloc necesar

source: Mount device busy
ro: Dispozitiv montare ocupat

source: File exists
ro: Fiºierul existã

source: Cross-device link
ro: Legãturã (link) între-dispozitive

source: No such device
ro: Nici un asemenea dispozitiv

source: Not a directory
ro: Nu este un director

source: Is a directory
ro: Este un director

source: Invalid argument
ro: Argument invalide

source: Too many open files in system
ro: Prea multe fiºiere deschise în sistem

source: Too many open files
ro: Prea multe fiºiere deschise

source: Not a typewriter
ro: Nu este o maºinã de scris (typewriter)

source: Text file busy
ro: Fiºier text ocupat

source: File too large
ro: Fiºier prea mare

source: No space left on device
ro: Spaþiu indisponibil pe dispozitiv

source: Illegal seek
ro: Cãutare ilegalã

source: Read only file system
ro: Citeºte numai sistemul de fiºiere

source: Too many links
ro: Prea multe legãturi (links)

source: Broken pipe
ro: Pipe spart(ã)

source: Math arg out of domain of func
ro: Argument matematic în afara domeniului funcþiei

source: Math result not representable
ro: Rezultatul matematic nu este reprezentabil

source: No message of desired type
ro: Nici un mesaj de tipul dorit

source: Identifier removed
ro: Identificator îndepãrtat

source: Channel number out of range
ro: Numãr canal în afara domeniului

source: Level 2 not synchronized
ro: Nivelul 2 nesincronizat

source: Level 3 halted
ro: Nivelul 3 oprit

source: Level 3 reset
ro: Nivelul 3 resetat

source: Link number out of range
ro: Numãr legãturi în afara domeniului

source: Protocol driver not attached
ro: Driver-ul de protocol nu este ataºat

source: No CSI structure available
ro: Nici o structurã CSI disponibilã

source: Level 2 halted
ro: Nivelul 2 oprit

source: Deadlock condition
ro: Condiþie blocare (Deadlock)

source: No record locks available
ro: Nici o încuietoare de articol (record lock) disponibilã

source: Invalid exchange
ro: Schimbare invalidã

source: Invalid request descriptor
ro: Descriptor de cerere invalid

source: Exchange full
ro: Schimbare întreagã

source: No anode
ro: Nici un anode

source: Invalid request code
ro: Cod de cerere invalid

source: Invalid slot
ro: Loc (slot) invalid

source: File locking deadlock error
ro: Eroare la descuierea (locking deadlock) fiºierului

source: Bad font file fmt
ro: Format fiºier font incorect

source: Device not a stream
ro: Dispozitivul nu este un flux (stream)

source: No data (for no delay io)
ro: Nici o datã (pentru intrare/ieºire fãrã întârziere)

source: Timer expired
ro: Cronometru expirat

source: Out of streams resources
ro: Resurse în afara fluxurilor

source: Machine is not on the network
ro: Maºina nu este pe reþea

source: Package not installed
ro: Pachet neinstalat

source: The object is remote
ro: Obiectul este îndepãrtat (remote)

source: The link has been severed
ro: Legãtura a fost întreruptã

source: Advertise error
ro: Eroare reclamare

source: Srmount error
ro: Eroare Srmount

source: Communication error on send
ro: Eroare de comunicare la trimitere

source: Protocol error
ro: Eroare protocol

source: Multihop attempted
ro: A fost încercat multihop

source: Inode is remote (not really error)
ro: Inode este îndepãrtat (în realitate nu este o eroare)

source: Cross mount point (not really error)
ro: Punct de montare încruciºat (în realitate nu este o eroare)

source: Trying to read unreadable message
ro: Încercare de citire a unui mesaj de necitit

source: Given log. name not unique
ro: Numele de jurnal (log) furnizat nu este unic

source: f.d. invalid for this operation
ro: f.d. invalid pentru aceastã operaþie

source: Remote address changed
ro: Adresa îndepãrtatã (remote) schimbatã

source: Can't access a needed shared lib
ro: Nu pot accesa o bibliotecã shared necesarã

source: Accessing a corrupted shared lib
ro: Accesez o bibliotecã shared coruptã

source: .lib section in a.out corrupted
ro: seciunea .lib în a.out este coruptã

source: Attempting to link in too many libs
ro: Încercare de legare (link) în prea multe biblioteci

source: Attempting to exec a shared library
ro: Încercare de executare a unei biblioteci shared

source: Function not implemented
ro: Funcþia nu este implematatã

source: No more files
ro: Nici un alt fiºier

source: Directory not empty
ro: Directorul nu este gol

source: File or path name too long
ro: Numele fiºierului sau cãii este prea lung

source: Too many symbolic links
ro: Pre multe legãturi simbolice

source: Operation not supported on transport endpoint
ro: Operaþia nu este suportatã pe transport endpoint

source: Protocol family not supported
ro: Familie de protocoale nesuportatã

source: Connection reset by peer
ro: Conectare resetatã de pereche

source: No buffer space available
ro: Nici un spaþiu de buffer disponibil

source: Address family not supported by protocol family
ro: Familia de adrese nu este suportatã de familia de protocoale

source: Protocol wrong type for socket
ro: Tip greºit de protocol pentru socket

source: Socket operation on non-socket
ro: Operaþiune socket pe non-socket

source: Protocol not available
ro: Protocol indisponibil

source: Can't send after socket shutdown
ro: Nu pot trimite dupã închiderea (shutdown) socket-ului

source: Connection refused
ro: Conectare refuzatã

source: Address already in use
ro: Adresa este deja în uz

source: Connection aborted
ro: Conectare abandonatã

source: Network is unreachable
ro: Reþeaua nu poate fi atinsã

source: Network interface is not configured
ro: Interfaþa de reþea nu este configuratã

source: Connection timed out
ro: Conectare expiratã (timed out)

source: Host is down
ro: Gazda este indisponibilã (down)

source: Host is unreachable
ro: Gazda este de neatins (unreachable)

source: Connection already in progress
ro: Conectare deja în progres

source: Socket already connected
ro: Socket deja conectat

source: Destination address required
ro: Adresa destinaþie necesarã

source: Message too long
ro: Mesaj prea lung

source: Unknown protocol
ro: Protocol necunoscut

source: Socket type not supported
ro: Tip de socket nesuportat

source: Address not available
ro: Adresa nu este disponibilã

source: Connection aborted by network
ro: Conectare abandonatã de reþea

source: Socket is already connected
ro: Socket-ul este deja conectat

source: Socket is not connected
ro: Socket-ul nu este conectat

source: Too many references: cannot splice
ro: Prea multe referinþe: nu le pot îmbina

source: Too many processes
ro: Prea multe procese

source: Too many users
ro: Prea mulþi utilizatori

source: Disk quota exceeded
ro: Cota de disc depãºitã

source: Unknown error
ro: Eroare necunoscutã

source: Not supported
ro: NU este suportat(ã)

source: No medium (in tape drive)
ro: Nici un mediu (în unitatea de bandã)

source: No such host or network path
ro: Nici o asemenea gazdã sau cale de reþea

source: Filename exists with different case
ro: Numele de fiºier existã cu cazul caracterelor diferit

source: ERROR: Unknown error %i in %s
ro: EROARE: Eroare necunoscutã %i în %s

source: Source RPM %d.%d
ro: Sursã RPM %d.%d

source: Binary RPM %d.%d
ro: Binar RPM %d.%d

source: Commands
ro: Comenzi

source: System calls
ro: Apeluri sistem

source: Library calls
ro: Apeluri de bibliotecã

source: Special files
ro: Fiºiere speciale

source: File formats and conventions
ro: Formate de fiºiere ºi convenþii

source: Games
ro: Jocuri

source: Conventions and miscellaneous
ro: Convenþii ºi diverse

source: System management commands
ro: Comenzi pentru managementul sistemului

source: Kernel routines
ro: Proceduri kernel

source: Fatal: could not allocate (%s at %s:%d).
ro: Fatal: nu am putut aloca (%s la %s:%d).

source: %ux%u dots per inch
ro: %ux%u puncte pe inci (dpi)

source: %ux%u dots per cm
ro: %ux%u puncte pe cm

source: %ux%u dots per inch?
ro: %ux%u puncte pe inci?

source: Classic Rock
ro: Rock clasic

source: Country
ro: Þarã

source: Other
ro: Altele

source: Classical
ro: Clasicã

source: Game
ro: Joc

source: Sound Clip
ro: Clip sonor

source: Noise
ro: Zgomot

source: Alt. Rock
ro: Rock Alternativ

source: Space
ro: Spaþiu

source: Meditative
ro: Meditativ

source: Humour
ro: Umor

source: Speech
ro: Discurs

source: Opera
ro: Operã

source: Chamber Music
ro: Muzicã de camerã

source: Sonata
ro: Sonet

source: Symphony
ro: Simfonie

source: (variable bps)
ro: (bps variabil)

source: Please provide the name of the language you are building a dictionary for. For example:
ro: Vã rugãm furnizaþi numele limbii pentru care contruiþi un dicþionar. De exemplu:

source: Error opening file '%s': %s
ro: Eroare deschidere fiºier '%s': %s

source: Error allocating: %s .
ro: Eroare de alocare: %s .

source: Increase ALLOCSIZE (in %s).
ro: Creºteþi ALLOCSIZE (în %s).
